# SetMaterialAspectByPropertySet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Material..::..SetMaterialAspectByPropertySet Method
Material Class See Also
---
Sets an aspect of the material to a shared property set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetMaterialAspectByPropertySet(
	MaterialAspect aspect,
	ElementId propertySetId
)
```

Visual Basic
---
```text
Public Sub SetMaterialAspectByPropertySet ( _
	aspect As MaterialAspect, _
	propertySetId As ElementId _
)
```

Visual C++
---
```text
public:
void SetMaterialAspectByPropertySet(
	MaterialAspect aspect,
	ElementId^ propertySetId
)
```

# ### Parameters
aspect
    Type: Autodesk.Revit.DB..::..MaterialAspect The material aspect.
propertySetId
    Type: Autodesk.Revit.DB..::..ElementId Identifier of a shared property set (an instance of PropertySetElement).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
Material Class
Autodesk.Revit.DB Namespace